import React from "react";

const SaintDemianaStory = () => {
  return (
    <div dir="rtl" className="bg-white font-main md:mx-12 text-gray-800  p-8">
      {/* Title Section */}
      <h1 className="text-4xl font-main font-bold text-center mb-8 text-red-800">
        القديسة الشهيدة دميانة
      </h1>

      {/* Birth Section */}
      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">نشأتها</h2>
        <p className="text-lg leading-relaxed">
          وُلدت من أبوين مسيحيين تقيين في أواخر القرن الثالث، كان أبوها مرقس
          واليًا على البرلس والزعفران بوادي السيسبان. إذ بلغت العام الأول من
          عمرها تعمدت في دير الميمة جنوب مدينة الزعفران، وأقام والدها مأدبة
          فاخرة للفقراء والمحتاجين لمدة ثلاثة أيام، بعد فترة انتقلت والدتها.
        </p>
      </section>

      {/* Prince Proposal Section */}
      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">
          أمير يطلب يدها
        </h2>
        <p className="text-lg leading-relaxed">
          تقدم أحد الأمراء إلى والدها يطلب يدها، وكانت معروفة بتقواها ومحبتها
          للعبادة مع جمالها وغناها وأدبها. عرض الوالد الأمر عليها، فأجابته:
          "لماذا تريد زواجي وأنا أود أن أعيش معك؟ هل تريدني أن أتركك؟" تعجب
          والدها لإجابتها هذه، فأرجأ الحديث عن الزواج. لاحظ على ابنته أنها عشقت
          الكتاب المقدس وارتوت به، وكانت تلجأ إلى حجرتها الخاصة تسكب دموع الحب
          الغزيرة أمام الله مخلصها، كما لاحظ تعلقها الشديد بالكنيسة مع كثرة
          أصوامها وصلواتها، وحضور كثير من الفتيات صديقاتها إليها يقضين وقتهن
          معها في حياة نسكية تتسم بكثرة الصلوات مع التسابيح المستمرة.
        </p>
      </section>

      {/* Building a Palace Section */}
      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">
          بناء قصر لها
        </h2>
        <p className="text-lg leading-relaxed">
          في سن الثامنة عشر كشفت عن عزمها على حياة البتولية، فرحب والدها بهذا
          الاتجاه. ولتحقيق هذه الرغبة بنى لها قصرًا في جهة الزعفران بناءً على
          طلبها، لتنفرد فيه للعبادة، واجتمع حولها أربعون من العذارى اللواتي نذرن
          البتولية. فرحت البتول الطاهرة دميانة لمحبة والدها لها التي فاقت المحبة
          العاطفية المجردة، إذ قدم ابنته الوحيدة ذبيحة حب لله. عاشت القديسة مع
          صاحباتها حياة نُسكية رائعة. امتزج الصوم بالصلاة مع التسبيح الذي حوَّل
          القصر إلى سماء يُسمع فيها صوت التهليل المستمر.
        </p>
      </section>

      {/* Father's Fall and Redemption Section */}
      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">
          سقوط والدها
        </h2>
        <p className="text-lg leading-relaxed">
          في أثناء الاضطهاد الذي أثاره دقلديانوس ضعف أبوها مرقس وبخر للأوثان.
          فما أن سمعت دميانة هذا الخبر حتى خرجت من عزلتها لتقابل والدها. طلبت
          القديسة دميانة من صديقاتها العذارى أن يصمن ويُصلين لأجل خلاص والدها
          حتى يرجع عن ضلاله. التقت القديسة بوالدها، وفي شجاعةٍ وبحزمٍ قالت له:
          "كنت أود أن أسمع خبر موتك عن أن تترك الإله الحقيقي". كما قالت له:
          "اعلم يا والدي أنك إذا تماديت في هذا الطغيان لست أعرفك وسأكون بريئة
          منك هنا وأمام عرش الديان حيث لا يكون لك نصيب في الميراث الأبدي الذي
          أعده الله لمحبيه وحافظي عهده". صارت تبكته بمرارة عن جحده لمسيحه مهما
          كانت الظروف. وسألته ألا يخاف الموت، بل يخاف من يُهلك النفس والجسد
          معًا، وألا يجامل الإمبراطور على حساب إيمانه وأبديته. مع حزمها الشديد
          وصراحتها الكاملة كانت دموع محبتها تنهار بلا توقف، وهي تقول له: "إن
          أصررت على جحدك للإله الحقيقي، فأنت لست بأبي ولا أنا ابنتك!"
        </p>
      </section>

      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">
          قيام مرقس من السقوط
        </h2>
        <p className="text-lg leading-relaxed">
          ألّهبت هذه الكلمات والدموع قلب مرقس، فبكى بكاءً مرًا وندم على ما
          ارتكبه. (ستجد المزيد عن هؤلاء القديسين هنا في موقع الأنبا تكلا في
          أقسام السير والسنكسار والتاريخ). في توبة صادقة بروح التواضع المملوء
          رجاءً قال لها: "مباركة هي هذه الساعة التي رأيتك فيها يا ابنتي. فقد
          انتشلتيني من الهوة العميقة التي ترديت فيها. وتجددت حياتي استعدادًا
          لملاقاة ربى العظيم الذي أؤمن أنه يقبلني إليه". وبروح الرجاء شكر الله
          الذي أيقظ قلبه قائلًا: "أشكرك يا إلهي لأنك نزعت ظلمة الكفر عن قلبي.
          الفخ انكسر ونحن نجونا..." فتركها للوقت وذهب إلى إنطاكية لمقابلة
          دقلديانوس وجهر أمامه بالإيمان، وندم عما أتاه من تبخير للأصنام. تعجّب
          الإمبراطور لتحوّل هذا الوالي المتسم بالطاعة، والذي ترك إيمانه وبخر
          للأوثان أنه يجاهر بإيمانه بكل قوة. وبخ مرقس الإمبراطور على جحده
          الإيمان، وحثه على الرجوع إلى الإيمان الحيّ. لم يتسرع الإمبراطور في
          معاقبته بل استخدم محاولات كثيرة لجذبه إليه، وإذ لم يتراجع مرقس ثارت
          ثائرة الطاغية، وأمر بقطع رأسه. وكان ذلك في الخامس من أبيب، في عيد
          الرسل. انتشر الخبر في كل الولاية وتهلل قلب ابنته القديسة دميانة، فقد
          نجا والدها من الهلاك الأبدي ليُشارك مسيحه أمجاده. وفي نفس الوقت حزن
          الإمبراطور على مرقس، إذ كان موضع اعتزازه وتقديره. بعد أيام علم
          دقلديانوس أن ابنته دميانة هي السبب في رجوع مرقس إلى الإيمان المسيحي،
          فأرسل إليها بعض الجنود، ومعهم آلات التعذيب، للانتقام منها ومن العذارى
          اللواتي يعشن معها. شاهدت القديسة الجند قد عسكروا حول القصر وأعدوا آلات
          التعذيب، فجمعت العذارى وبروح النصرة أعلنت أن الإمبراطور قد أعد كل شيء
          ليُرعبهم، لكن وقت الإكليل قد حضر، فمن أرادت التمتع به فلِتنتظر، وأما
          الخائفة فلتهرب من الباب الخلفي. فلم يوجد بينهن عذراء واحدة تخشى الموت.
          بفرحٍ شديدٍ قُلن أنهم متمسكات بمسيحهن ولن يهربن.
        </p>
      </section>
      <section className="mb-12">
        <h2 className="text-2xl font-semibold mb-4 text-red-800">
          شركة آلام مع المسيح:
        </h2>
        <p className="text-lg leading-relaxed">
          التقى القائد بالقديسة وأخبرها بأن الإمبراطور يدعوها للسجود للآلهة
          ويقدم لها كنوزًا كثيرة ويُقيمها أميرة عظيمة. أما هي فأجابته: "أما
          تستحي أن تدعو الأصنام آلهة، فليس إله سوى رب السماء والأرض. وأنا ومن
          معي مستعدات أن نموت من أجل اسمه". اغتاظ القائد وأمر أربعة جنود بوضعها
          داخل الهنبازين لكي تُعْصَر. وكانت العذارى يبكين وهنّ ينظرن إليها
          تُعصر. أُلقيت في السجن وهي أشبه بميتة، فحضر رئيس الملائكة ميخائيل في
          منتصف الليل ومسح كل جراحاتها. في الصباح دخل الجند السجن لينقلوا خبر
          موتها للقائد، فكانت دهشتهم أنهم لم يجدوا أثرًا للجراحات في جسمها.
          أعلنوا ذلك للقائد، فثار جدًا وهو يقول: "دميانة ساحرة! لابد من إبطال
          سحرها!" إذ رأتها الجماهير صرخوا قائلين: "إننا نؤمن بإله دميانة"، وأمر
          القائد بقتلهم. ازداد القائد حنقًا ووضع في قلبه أن ينتقم من القديسة
          بمضاعفة العذابات، حاسبًا أنها قد ضلَّلت الكثيرين. أمر بتمشيط جسمها
          بأمشاط حديدية، وتدليكه بالخل والجير، أما هي فكانت متهللة. إذ حسبت
          نفسها غير أهلٍ لمشاركة السيد المسيح آلامه. أُلقيت في السجن، وفي اليوم
          الثاني ذهب القائد بنفسه إلى السجن حاسبًا أنه سيجدها جثة هامدة، لكنه
          انهار حين وجدها سليمة تمامًا، فقد ظهر لها رئيس الملائكة ميخائيل
          وشفاها. في ثورة عارمة بدأ يُعذبها بطرق كثيرة ككسر جمجمتها وقلع عينيها
          وسلخ جلدها، لكن حمامة بيضاء نزلت من السماء وحلّقت فوقها فصارت القديسة
          معافاة. كلما حاول القائد تعذيبها كان الرب يتمجد فيها. أخيرًا أمر
          بضربها بالسيف هي ومن معها من العذارى، فنلن جميعًا أكاليل الشهادة. وقبل
          أن يهوي السيف على رقبة القديسة دميانة قالت: "إني أعترف بالسيد المسيح،
          وعلى اسمه أموت، وبه أحيا إلى الأبد". وكان ذلك في 13 طوبة. مازال جسد
          الشهيدة دميانة في كنيستها التي شيدتها لها الملكة هيلانة أم الملك
          قسطنطين، والكائنة قرب بلقاس في شمال الدلتا. قام البابا الكسندروس
          بتدشينها في اليوم الثاني عشر من شهر بشنس. ملحق بالكنيسة دير القديسة
          دميانة، كما بنيت كنائس كثيرة باسمها في القطر المصري.{" "}
        </p>
      </section>
    </div>
  );
};

export default SaintDemianaStory;
